/* 
                    =================টাস্ক - ১===============

১. জাভাস্ক্রিপ্ট নিয়ে প্রথম মডিউল এর এক নাম্বার ভিডিওতে এ যে আলোচনা করা হয়েছে সেগুলো 
 একটু এক্সপ্লোর করো।

২. V8 Engine এর mechanism সম্পর্কে একটু জানো।

৩. Single-threaded কি এবং জাভাস্ক্রিপ্ট এর কোন কোন জিনিস asynchronous সেটার একটা লিষ্ট  
   গুগলে সার্চ দিয়ে বের করে ফেলো। 

৪. setTimeout এর ভিতরে একটা কিছু কনসোল লগ করবে যেটা সাড়ে তিন সেকেন্ড পরে আউটপুট 
   দেখাবে।

৫. event loop লুপ কি জিনিস। এই রিলেটেড পুরা জিনিসটা আজকে অনেকেই বুঝবে না। তাও 
  আরেকবার দেখে রাখবে।

৬. Call Stack , event queue কিভাবে কাজ করে সে সম্পর্কে একটু গুগল করে দেখো।

৭. Try, catch, finally এবং throw নিয়ে একটু গুগল এ সার্চ দাও।

৮ গত দুই মডিউল যে interview questions গুলো দেওয়া হয়েছে সেগুলো অব্বশই এক্সপ্লোর করে  
  পড়বে এবং নোটস নিবে।


                    ===============টাস্ক-২================

১. “Common types of errors in JS” লিখে গুগল সার্চ দাও এবং যে যে এরর নিয়ে মডিউল এ আলোচনা 
   করা হয়েছে সেগুলো নিয়ে ব্লগ গুলো থেকে পড়ো। এরর মেসেজ গুলো বুঝার চেষ্টা করো।

২. আমাদের গিটহাব এ যাও। সেখানে nosto-bank নামে একটা রিপোজটিরি আছে। সেটা ক্লোন করো। 

৩. সেখানেও কী কী বাগ আছে। তুমি নিজে নিজে খুঁজে বের করার চেষ্টা করো। মিনিমাম তিনটা বাগ 
  খুঁজে বের করে সেগুলা ফিক্স করার চেষ্টা করো। আরো বেশি বাগ আছে কিনা খুঁজে বের করো। 

৪. আর এর পাশাপাশি যদি shopping-list এবং money master প্রাকটিস করতে চাও তাহলে করতে  
  পারো।


*/